app/Services/AccountService.php

select * from `users` where (`email` = 'test@kafila.info') limit 1
---
    public function loginAttemp(WebRequest $request) : WebResponse
    {
        $user = $request->user;
        $response = new WebResponse();
        $cred = ['email' => $user->email, 'password' => $user->password];
        out(" request : ", $request);
        $dbUser = User::where(['email' => $user->email])->first();

update `users` set `api_token` = '5cb8f04b542c77300548285e7b70fa6fb728f7ab440cb50b1819f06aa3b1704d', `users`.`updated_at` = '2021-03-29 14:18:26' where `id` = '99e7eb07-23eb-4c20-aa00-1931fb87b8b7'
---
    private function updateApiToken($id, string $token)
    {
        $user = User::find($id);
        $user->api_token = $token;
        $user->save();