app/Services/AuthService.php

update `users` set `api_token` = '', `users`.`updated_at` = '2021-03-29 14:27:08' where `id` = '1234567757575757565'
---
    public function logout(User $requestUser) : WebResponse
    {
        Auth::logout();
        $user = User::find($requestUser->id);
        $user->api_token = null;
        $user->save();