app/Services/ConfigurationService.php

    public function getApplicationProfile(): ApplicationProfile
    {
        // return (ApplicationProfile::defaultModel());
        $existing = ApplicationProfile::with('division_head', 'school_director')->
            where(['code'=>ApplicationProfile::$CODE])->first();
---
select * from `application_profiles` where (`code` = 'ASRAMA_KIIS') limit 1