app/Services/MusyrifManagementService.php

    private function populateWithUser(array $employees)
    {
        $nip_array = [];
        foreach ($employees as $employee) {
            array_push($nip_array, $employee->nip);
        }
        $users = User::whereIn('nip', $nip_array)->get();
---
select * from `users` where `nip` in ('2019090', '2019120', '2019002', '2020093012345', '2012054', '2006008', '2019095', '2013061', '2019096', '2018086', '44440003', '2019104', '2008015', '2014073', '2014072', '2019093', '12121212', '2011042', '2018084', '44440006', '2019098', '2019094', '2009022', '2019109', '2006004', '2019200', '2011049', '33334', '2011050', '20200721888', '44440008', '2013058', '2017081', '2019010', '2018001', '2018085', '2010031', '2019105', '1234567879', '2011040', '237238738273', '2019112', '2019111', '2019097', '2019122', '5545556354654', '2019110', '2019121', '234523452345', '2010036', '5787857867', '4768474645674567', 'P2020', '44440002', '44440007', '2018082', '363837474843', '774565457', '2019117', '2019011', '5785785678', '44440012', '57856785678', '2019103', '2019113', '94768468467867', '44440010', '67467457467467467', '44440009', '46745674567456747', '34343433256', '44440011', '44440001', '2019119', '4845787567467467467', '2019099', '2019092', '2019101', '45247867456746746746', '2019115', '44440005', '1235445', '2006011', '2009083', '2019118', '12345', '2019100', '123456', '2014064', '2014075', '2019091', '2010034', '2019114', '4444013', '89283298399', '2019112', '2019106', '35635763563563456', '2019107', '2018088', '2011043', 'SMTR-02-08-2020', '2010037', '464677674687', '44440004', '00012019', '2019108', '2019116', '2018089', '2016079', '2017080', '2019102')

    public function activate(WebRequest $request) :WebResponse
    {
        $employee = Pegawai::find($request->employee_id);
        if (is_null($employee)) {
            throw new Error("Employee with id: $request->employee_id not found");
        }
        $user = User::where('nip', $employee->nip)->first();
---
select * from `users` where `nip` = '2019092' limit 1