app/Models/User.php

update `users` set `roles` = '[\"employee\",\"user\",\"wali_kelas\",\"musyrif_asrama\"]', `users`.`updated_at` = '2021-03-30 07:35:06' where `id` = '8850ac07-3cd8-4946-88a8-2d0fc90fa0d1'
---
    public function addRole(string $role)
    {
        if ($this->hasRole($role)) {
            return;
        }
        $user_roles = json_decode($this->roles);

        array_push($user_roles, $role);
        $this->roles = json_encode($user_roles);
        $this->setAttribute('roles', $user_roles);
        $this->save();

update `users` set `roles` = '[\"employee\",\"user\",\"wali_kelas\"]', `users`.`updated_at` = '2021-03-30 07:35:18' where `id` = '8850ac07-3cd8-4946-88a8-2d0fc90fa0d1'
---
    public function removeRole(string $role)
    {
        if (false == $this->hasRole($role)) {
            return;
        }
        $user_roles = json_decode($this->roles);
        for ($i=0; $i < sizeof($user_roles); $i++) {
            if ($role == $user_roles[$i]) {
                array_splice($user_roles, $i, 1);
                break;
            }
        }
        $this->roles  = json_encode($user_roles);
        $this->setAttribute('roles', $user_roles);
        $this->save();